drop table if exists pms_product_attribute_group;
create table pms_product_attribute_group
(
    id          bigint auto_increment comment '主键id'
        primary key,
    category_id bigint                             not null comment '分类ID',
    name        varchar(50)                        not null comment '分组名称',
    sort        int      default 0                 not null comment '排序',
    status      tinyint  default 1                 not null comment '状态：0->禁用；1->启用',
    create_by   bigint   default 1                 not null comment '创建人ID',
    create_time datetime default CURRENT_TIMESTAMP not null comment '创建时间',
    update_by   bigint                             null comment '更新人ID',
    update_time datetime                           null on update CURRENT_TIMESTAMP comment '更新时间',
    is_deleted  tinyint  default 0                 not null comment '是否删除'
)
    comment '商品属性分组表';

create index idx_category
    on pms_product_attribute_group (category_id, is_deleted);

-- 插入商品属性分组数据
INSERT INTO pms_product_attribute_group (category_id, name, sort)
VALUES

-- 手机(id=1)属性组
(1, '基本信息', 1),
(1, '主体参数', 2),
(1, '网络参数', 3),
(1, '显示参数', 4),
(1, '摄像功能', 5),
-- 小米手机(id=8)属性组
(8, '基本信息', 1),
(8, '主体参数', 2),
(8, '网络参数', 3),
(8, '显示参数', 4),
(8, '摄像功能', 5),
-- 苹果手机(id=9)属性组
(9, '基本信息', 1),
(9, '主体参数', 2),
(9, '网络参数', 3),
(9, '显示参数', 4),
(9, '摄像功能', 5),
-- 华为手机(id=10)属性组
(10, '基本信息', 1),
(10, '主体参数', 2),
(10, '网络参数', 3),
(10, '显示参数', 4),
(10, '摄像功能', 5),
-- 三星手机(id=11)属性组
(11, '基本信息', 1),
(11, '主体参数', 2),
(11, '网络参数', 3),
(11, '显示参数', 4),
(11, '摄像功能', 5),
-- 荣耀手机(id=12)属性组
(12, '基本信息', 1),
(12, '主体参数', 2),
(12, '网络参数', 3),
(12, '显示参数', 4),
(12, '摄像功能', 5),

# -- 电脑(id=2)属性组
(2, '基本信息', 1),
(2, '处理器', 2),
(2, '内存容量', 3),
(2, '显卡性能', 4),
(2, '存储容量', 5),
# -- 苹果电脑(id=13)属性组
(13, '基本信息', 1),
(13, '处理器', 2),
(13, '内存容量', 3),
(13, '显卡性能', 4),
(13, '存储容量', 5),
# -- 小米电脑(id=14)属性组
(14, '基本信息', 1),
(14, '处理器', 2),
(14, '内存容量', 3),
(14, '显卡性能', 4),
(14, '存储容量', 5),
# -- 华为电脑(id=15)属性组
(15, '基本信息', 1),
(15, '处理器', 2),
(15, '内存容量', 3),
(15, '显卡性能', 4),
(15, '存储容量', 5),

-- 服装(id=3)通用属性组
(3, '基本信息', 1),
(3, '材质参数', 2),
(3, '尺码参数', 3),
(3, '季节', 4),
-- 海澜之家(id=16)通用属性组
(16, '基本信息', 1),
(16, '材质参数', 2),
(16, '尺码参数', 3),
(16, '季节', 4),

-- 电器(id=4)通用属性组
(4, '基本信息', 1),
(4, '规格参数', 2),
(4, '功能特点', 3),
-- 电饭锅(id=17)通用属性组
(17, '基本信息', 1),
(17, '规格参数', 2),
(17, '功能特点', 3),

-- 空调(id=5)通用属性组
(5, '基本信息', 1),
(5, '规格参数', 2),
(5, '功能特点', 3),
-- 格力空调(id=17)通用属性组
(18, '基本信息', 1),
(18, '规格参数', 2),
(18, '功能特点', 3),

# -- 厨房电器(id=6)属性组
(6, '基本信息', 1),
(6, '功率参数', 2),
(6, '特色功能', 3),
# -- 方太电器(id=19)属性组
(19, '基本信息', 1),
(19, '功率参数', 2),
(19, '特色功能', 3),

# -- 热水器(id=7)属性组
(7, '基本信息', 1),
(7, '功率参数', 2),
(7, '特色功能', 3),
(7, '安全参数', 4),
# -- 万和热水器(id=20)属性组
(20, '基本信息', 1),
(20, '功率参数', 2),
(20, '特色功能', 3),
(20, '安全参数', 4),
# -- 万家乐热水器(id=21)属性组
(21, '基本信息', 1),
(21, '功率参数', 2),
(21, '特色功能', 3),
(21, '安全参数', 4),
# -- 海尔热水器(id=22)属性组
(22, '基本信息', 1),
(22, '功率参数', 2),
(22, '特色功能', 3),
(22, '安全参数', 4),
# -- 美的热水器(id=23)属性组
(23, '基本信息', 1),
(23, '功率参数', 2),
(23, '特色功能', 3),
(23, '安全参数', 4);
