drop table if exists pms_product_spec_value;
create table pms_product_spec_value
(
    id          bigint auto_increment
        primary key,
    spec_id     bigint                             not null comment '规格ID',
    value       varchar(50)                        not null comment '规格值',
    sort        int      default 0                 not null comment '排序',
    status      tinyint  default 1                 not null comment '状态：0->禁用；1->启用',
    create_by   bigint   default 1                 not null comment '创建人ID',
    create_time datetime default CURRENT_TIMESTAMP not null comment '创建时间',
    update_by   bigint                             null comment '更新人ID',
    update_time datetime                           null on update CURRENT_TIMESTAMP comment '更新时间',
    is_deleted  tinyint  default 0                 not null comment '是否删除'
)
    comment '商品规格值表';

create index idx_spec
    on pms_product_spec_value (spec_id, is_deleted);

-- 插入商品规格值数据
INSERT INTO pms_product_spec_value (spec_id, value, sort)
VALUES
-- 手机颜色规格值
(1, '暗紫色', 1),
(1, '自然色', 2),
(1, '银色', 3),
(1, '金色', 4),
-- 手机容量规格值
(2, '128GB', 1),
(2, '256GB', 2),
(2, '512GB', 3),
(2, '1TB', 4),
-- 手机网络版本规格值
(3, '全网通版', 1),
(3, '5G版', 2),

-- 小米手机颜色规格值
(4, '暗紫色', 1),
(4, '自然色', 2),
(4, '银色', 3),
(4, '金色', 4),
-- 小米手机容量规格值
(5, '128GB', 1),
(5, '256GB', 2),
(5, '512GB', 3),
(5, '1TB', 4),
-- 小米手机网络版本规格值
(6, '全网通版', 1),
(6, '5G版', 2),

-- 苹果手机颜色规格值
(7, '暗紫色', 1),
(7, '自然色', 2),
(7, '银色', 3),
(7, '金色', 4),
-- 苹果手机容量规格值
(8, '128GB', 1),
(8, '256GB', 2),
(8, '512GB', 3),
(8, '1TB', 4),
-- 苹果手机网络版本规格值
(9, '全网通版', 1),
(9, '5G版', 2),

-- 华为手机颜色规格值
(10, '暗紫色', 1),
(10, '自然色', 2),
(10, '银色', 3),
(10, '金色', 4),
-- 华为手机容量规格值
(11, '128GB', 1),
(11, '256GB', 2),
(11, '512GB', 3),
(11, '1TB', 4),
-- 华为手机网络版本规格值
(12, '全网通版', 1),
(12, '5G版', 2),

-- 三星手机颜色规格值
(13, '暗紫色', 1),
(13, '自然色', 2),
(13, '银色', 3),
(13, '金色', 4),
-- 三星手机容量规格值
(14, '128GB', 1),
(14, '256GB', 2),
(14, '512GB', 3),
(14, '1TB', 4),
-- 三星网络版本规格值
(15, '全网通版', 1),
(15, '5G版', 2),

-- 荣耀手机颜色规格值
(16, '暗紫色', 1),
(16, '自然色', 2),
(16, '银色', 3),
(16, '金色', 4),
-- 荣耀手机容量规格值
(17, '128GB', 1),
(17, '256GB', 2),
(17, '512GB', 3),
(17, '1TB', 4),
-- 荣耀手机网络版本规格值
(18, '全网通版', 1),
(18, '5G版', 2),

-- 电脑颜色规格值
(19, '深空灰', 1),
(19, '银色', 2),
(19, '黑色', 3),
-- 电脑内存规格值
(20, '8GB', 1),
(20, '16GB', 2),
(20, '32GB', 3),
-- 电脑硬盘规格值
(21, '256GB', 1),
(21, '512GB', 2),
(21, '1TB', 3),

-- 苹果电脑颜色规格值
(22, '深空灰', 1),
(22, '银色', 2),
(22, '黑色', 3),
-- 苹果电脑内存规格值
(23, '8GB', 1),
(23, '16GB', 2),
(23, '32GB', 3),
-- 苹果电脑硬盘规格值
(24, '256GB', 1),
(24, '512GB', 2),
(24, '1TB', 3),

-- 小米电脑颜色规格值
(25, '深空灰', 1),
(25, '银色', 2),
(25, '黑色', 3),
-- 小米电脑内存规格值
(26, '8GB', 1),
(26, '16GB', 2),
(26, '32GB', 3),
-- 小米电脑硬盘规格值
(27, '256GB', 1),
(27, '512GB', 2),
(27, '1TB', 3),

-- 华为电脑颜色规格值
(28, '深空灰', 1),
(28, '银色', 2),
(28, '黑色', 3),
-- 华为电脑内存规格值
(29, '8GB', 1),
(29, '16GB', 2),
(29, '32GB', 3),
-- 华为电脑硬盘规格值
(30, '256GB', 1),
(30, '512GB', 2),
(30, '1TB', 3),

-- 服装颜色规格值
(31, '黑色', 1),
(31, '白色', 2),
(31, '灰色', 3),
(31, '藏青色', 4),
-- 服装尺码规格值
(32, 'S', 1),
(32, 'M', 2),
(32, 'L', 3),
(32, 'XL', 4),
(32, 'XXL', 5),

-- 海澜之家服装颜色规格值
(33, '黑色', 1),
(33, '白色', 2),
(33, '灰色', 3),
(33, '藏青色', 4),
-- 海澜之家服装尺码规格值
(34, 'S', 1),
(34, 'M', 2),
(34, 'L', 3),
(34, 'XL', 4),
(34, 'XXL', 5),

-- 电器颜色规格值
(35, '白色', 1),
(35, '银色', 2),
(35, '黑色', 3),
-- 电器容量规格值
(36, '3L', 1),
(36, '4L', 2),
(36, '5L', 3),
-- 电器功率规格值
(37, '1500W', 1),
(37, '2000W', 2),
(37, '3000W', 3),

-- 电饭锅颜色规格值
(38, '白色', 1),
(38, '银色', 2),
(38, '黑色', 3),
-- 电饭锅容量规格值
(39, '3L', 1),
(39, '4L', 2),
(39, '5L', 3),
-- 电饭锅功率规格值
(40, '1500W', 1),
(40, '2000W', 2),
(40, '3000W', 3),

-- 空调颜色规格值
(41, '白色', 1),
(41, '银色', 2),
(41, '黑色', 3),
-- 空调型号规格值
(42, '2024', 1),
(42, '2025', 2),
(42, '2026', 3),
-- 空调功率规格值
(43, '1500W', 1),
(43, '2000W', 2),
(43, '3000W', 3),

-- 格力空调颜色规格值
(44, '白色', 1),
(44, '银色', 2),
(44, '黑色', 3),
-- 格力空调型号规格值
(45, '2024', 1),
(45, '2025', 2),
(45, '2026', 3),
-- 格力空调功率规格值
(46, '1500W', 1),
(46, '2000W', 2),
(46, '3000W', 3),


-- 厨房颜色规格值
(47, '白色', 1),
(47, '银色', 2),
(47, '黑色', 3),
-- 厨房火力规格值
(48, '大', 1),
(48, '中', 2),
(48, '小', 3),
-- 厨房功率规格值
(49, '1500W', 1),
(49, '2000W', 2),
(49, '3000W', 3),

-- 方太颜色规格值
(50, '白色', 1),
(50, '银色', 2),
(50, '黑色', 3),
-- 方太火力规格值
(51, '大', 1),
(51, '中', 2),
(51, '小', 3),
-- 方太功率规格值
(52, '1500W', 1),
(52, '2000W', 2),
(52, '3000W', 3),

-- 热水器颜色规格值
(53, '白色', 1),
(53, '银色', 2),
(53, '黑色', 3),
-- 热水器容量规格值
(54, '60L', 1),
(54, '80L', 2),
(54, '100L', 3),
-- 热水器款式规格值
(55, '2024', 1),
(55, '2025', 2),
(55, '2026', 3),
-- 热水器功率规格值
(56, '1500W', 1),
(56, '2000W', 2),
(56, '3000W', 3),

-- 万和热水器颜色规格值
(57, '白色', 1),
(57, '银色', 2),
(57, '黑色', 3),
-- 万和热水器容量规格值
(58, '60L', 1),
(58, '80L', 2),
(58, '100L', 3),
-- 万和 热水器款式规格值
(59, '2024', 1),
(59, '2025', 2),
(59, '2026', 3),
-- 万和热水器功率规格值
(60, '1500W', 1),
(60, '2000W', 2),
(60, '3000W', 3),

-- 万家乐热水器颜色规格值
(61, '白色', 1),
(61, '银色', 2),
(61, '黑色', 3),
-- 万家乐热水器容量规格值
(62, '60L', 1),
(62, '80L', 2),
(62, '100L', 3),
-- 万家乐热水器款式规格值
(63, '2024', 1),
(63, '2025', 2),
(63, '2026', 3),
-- 万家乐热水器功率规格值
(64, '1500W', 1),
(64, '2000W', 2),
(64, '3000W', 3),

-- 海尔热水器颜色规格值
(65, '白色', 1),
(65, '银色', 2),
(65, '黑色', 3),
-- 海尔热水器容量规格值
(66, '60L', 1),
(66, '80L', 2),
(66, '100L', 3),
-- 海尔热水器款式规格值
(67, '2024', 1),
(67, '2025', 2),
(67, '2026', 3),
-- 海尔热水器功率规格值
(68, '1500W', 1),
(68, '2000W', 2),
(68, '3000W', 3),

-- 美的热水器颜色规格值
(69, '白色', 1),
(69, '银色', 2),
(69, '黑色', 3),
-- 美的热水器容量规格值
(70, '60L', 1),
(70, '80L', 2),
(70, '100L', 3),
-- 美的热水器款式规格值
(71, '2024', 1),
(71, '2025', 2),
(71, '2026', 3),
-- 美的热水器功率规格值
(72, '1500W', 1),
(72, '2000W', 2),
(72, '3000W', 3);
