drop table if exists pms_product_sku;
create table pms_product_sku
(
    id                   bigint auto_increment
        primary key comment '商品SkuId',
    spu_id               bigint                             not null comment '商品SpuId',
    name                 varchar(200)                       not null comment 'SKU名称',
    sku_code             varchar(50)                        not null comment 'SKU编码',
    main_pic             varchar(255)                       not null comment '主图',
    album_pics           varchar(1000)                      not null comment '图片集',
    price                decimal(10, 2)                     not null comment '价格',
    promotion_price      decimal(10, 2)                     not null comment '单品促销价格',
    promotion_start_time datetime                           null comment '促销开始时间',
    promotion_end_time   datetime                           null comment '促销结束时间',
    stock                int                                not null comment '库存',
    low_stock            int                                not null comment '预警库存',
    spec_data            json                               not null comment '规格数据',
    weight               decimal(10, 2)                     not null comment '重量(kg)',
    publish_status       tinyint  default 0                 not null comment '上架状态：0-下架，1-上架',
    verify_status        tinyint  default 0                 not null comment '审核状态：0-未审核，1-审核通过，2-审核不通过',
    sort                 int      default 1                 not null comment '排序',
    sales                int      default 0                 not null comment '销量',
    create_by            bigint    default 1                        not null comment '创建人ID',
    create_time          datetime default CURRENT_TIMESTAMP not null comment '创建时间',
    update_by            bigint                             null comment '更新人ID',
    update_time          datetime                           null on update CURRENT_TIMESTAMP comment '更新时间',
    is_deleted           tinyint  default 0                 not null comment '是否删除',
    constraint uk_sku_code
        unique (sku_code, is_deleted)
)
    comment '商品SKU表';

create index idx_spu_id
    on pms_product_sku (spu_id, is_deleted);

-- 插入商品SKU数据
insert into pms_product_sku ( spu_id, name, sku_code, main_pic, album_pics, price, promotion_price, stock, low_stock, spec_data, weight, publish_status, verify_status, sort, sales)
values
# 小米手机
( 1, '小米手机 金色 128GB 全网通版', '123', 'http://129.204.203.29/xiaomi_s.jpg', '', 7999.00, 7899.00, 1000, 100, '{"颜色": "金色", "容量": "128GB", "网络版本": "全网通版"}', 0.19, 1, 1, 1, 300),
( 1, '小米手机 金色 256GB 全网通版', '1231', 'http://129.204.203.29/xiaomi_s.jpg', '', 8999.00, 8899.00, 800, 80, '{"颜色": "金色", "容量": "256GB", "网络版本": "全网通版"}', 0.19, 1, 1, 2, 200),
# 苹果手机
( 2, '苹果手机 金色 128GB 全网通版', '1223', 'http://129.204.203.29/apple_s.jpg', '', 7999.00, 7899.00, 1000, 100, '{"颜色": "金色", "容量": "128GB", "网络版本": "全网通版"}', 0.19, 1, 1, 1, 300),
( 2, '苹果手机 金色 256GB 全网通版', '1233', 'http://129.204.203.29/apple_s.jpg', '', 8999.00, 8899.00, 800, 80, '{"颜色": "金色", "容量": "256GB", "网络版本": "全网通版"}', 0.19, 1, 1, 2, 200),
# 华为手机
( 3, '华为手机 金色 128GB 全网通版', '1213', 'http://129.204.203.29/hua_s.jpg', '', 7999.00, 7899.00, 1000, 100, '{"颜色": "金色", "容量": "128GB", "网络版本": "全网通版"}', 0.19, 1, 1, 1, 300),
( 3, '华为手机 金色 256GB 全网通版', '1253', 'http://129.204.203.29/hua_s.jpg', '', 8999.00, 8899.00, 800, 80, '{"颜色": "金色", "容量": "256GB", "网络版本": "全网通版"}', 0.19, 1, 1, 2, 200),
# 三星手机
( 4, '三星手机 金色 128GB 全网通版', '1623', 'http://129.204.203.29/sumsang.jpg', '', 7999.00, 7899.00, 1000, 100, '{"颜色": "金色", "容量": "128GB", "网络版本": "全网通版"}', 0.19, 1, 1, 1, 300),
( 4, '三星手机 金色 256GB 全网通版', '1723', 'http://129.204.203.29/sumsang.jpg', '', 8999.00, 8899.00, 800, 80, '{"颜色": "金色", "容量": "256GB", "网络版本": "全网通版"}', 0.19, 1, 1, 2, 200),
# 荣耀手机
( 5, '荣耀手机 金色 128GB 全网通版', '12833', 'http://129.204.203.29/rong_s.jpg', '', 7999.00, 7899.00, 1000, 100, '{"颜色": "金色", "容量": "128GB", "网络版本": "全网通版"}', 0.19, 1, 1, 1, 300),
( 5, '荣耀手机 金色 256GB 全网通版', '12831', 'http://129.204.203.29/rong_s.jpg', '', 8999.00, 8899.00, 800, 80, '{"颜色": "金色", "容量": "256GB", "网络版本": "全网通版"}', 0.19, 1, 1, 2, 200),

# 苹果电脑
( 6, '苹果电脑 金色 16G 256GB', '12193', 'http://129.204.203.29/apple_c.jpg', '', 7999.00, 7899.00, 1000, 100, '{"颜色": "金色", "内存": "16G", "硬盘": "256GB"}', 0.19, 1, 1, 1, 300),
( 6, '苹果电脑 金色 32G 512GB', '1293', 'http://129.204.203.29/apple_c.jpg', '', 8999.00, 8899.00, 800, 80, '{"颜色": "金色", "内存": "32G", "硬盘": "512GB"}', 0.19, 1, 1, 2, 200),
# 小米电脑
( 7, '小米电脑 金色 16G 256GB', '10323', 'http://129.204.203.29/xiaomi_c.jpg', '', 7999.00, 7899.00, 1000, 100, '{"颜色": "金色", "内存": "16G", "硬盘": "256GB"}', 0.19, 1, 1, 1, 300),
( 7, '小米电脑 金色 32G 512GB', '1023', 'http://129.204.203.29/xiaomi_c.jpg', '', 8999.00, 8899.00, 800, 80, '{"颜色": "金色", "内存": "32G", "硬盘": "512GB"}', 0.19, 1, 1, 2, 200),
# 华为电脑
( 8, '华为电脑 金色 16G 256GB', '1203', 'http://129.204.203.29/hua_c.jpg', '', 7999.00, 7899.00, 1000, 100, '{"颜色": "金色", "内存": "16G", "硬盘": "256GB"}', 0.19, 1, 1, 1, 300),
( 8, '华为电脑 金色 32G 512GB', '12013', 'http://129.204.203.29/hua_c.jpg', '', 8999.00, 8899.00, 800, 80, '{"颜色": "金色", "内存": "32G", "硬盘": "512GB"}', 0.19, 1, 1, 2, 200),

# 海澜之家
( 9, '海澜之家 黑色 L', '12543', 'http://129.204.203.29/hailan.jpg', '', 7999.00, 7899.00, 1000, 100, '{"颜色": "黑色", "尺码": "L"}', 0.19, 1, 1, 1, 300),
( 9, '海澜之家 黑色 XL', '12311', 'http://129.204.203.29/hailan.jpg', '', 8999.00, 8899.00, 800, 80, '{"颜色": "黑色", "尺码": "XL"}', 0.19, 1, 1, 2, 200),

# 苏泊尔
( 10, '苏泊尔 银色 3L 1500W', '12163', 'http://129.204.203.29/su.jpg', '', 7999.00, 7899.00, 1000, 100, '{"颜色": "黑色", "容量": "3L", "功率": "1500W"}', 0.19, 1, 1, 1, 300),
( 10, '苏泊尔 银色 4L 2000W ', '12113', 'http://129.204.203.29/su.jpg', '', 8999.00, 8899.00, 800, 80, '{"颜色": "黑色", "容量": "4L", "功率": "2000W"}', 0.19, 1, 1, 2, 200),


# 格力空调
( 11, '格力空调 银色 2024 1500W', '123231', 'http://129.204.203.29/geli.jpg', '', 7999.00, 7899.00, 1000, 100, '{"颜色": "黑色", "型号": "2024", "功率": "1500W"}', 0.19, 1, 1, 1, 300),
( 11, '格力空调 银色 2025 2000W ', '1143', 'http://129.204.203.29/geli.jpg', '', 8999.00, 8899.00, 800, 80, '{"颜色": "黑色", "型号": "2025", "功率": "2000W"}', 0.19, 1, 1, 2, 200),


# 方太燃气灶
( 12, '方太燃气灶 黑色 大 1500W', '12351', 'http://129.204.203.29/fangtai.jpg', '', 7999.00, 7899.00, 1000, 100, '{"颜色": "黑色", "火力": "大", "功率": "1500W"}', 0.19, 1, 1, 1, 300),
( 12, '方太燃气灶 黑色 小 2000W ', '12323', 'http://129.204.203.29/fangtai.jpg', '', 8999.00, 8899.00, 800, 80, '{"颜色": "黑色", "火力": "小", "功率": "2000W"}', 0.19, 1, 1, 2, 200),

# 万和热水器
( 13, '万和热水器 黑色 60L 2024 1500W', '12322', 'http://129.204.203.29/wanhe.png', '', 7999.00, 7899.00, 1000, 100, '{"颜色": "黑色", "容量": "60L", "款式": "2024", "功率": "1500W"}', 0.19, 1, 1, 1, 300),
( 13, '万和热水器 银色 100L 2025 3000W ', '12223', 'http://129.204.203.29/wanhe.png', '', 8999.00, 8899.00, 800, 80, '{"颜色": "银色", "容量": "100L", "款式": "2025", "功率": "3000W"}', 0.19, 1, 1, 2, 200),
# 万家乐热水器
( 14, '万家乐热水器 黑色 60L 2024 3000W', '12333', 'http://129.204.203.29/wanjiale.jpg', '', 7999.00, 7899.00, 1000, 100, '{"颜色": "黑色", "容量": "60L", "款式": "2024", "功率": "3000W"}', 0.19, 1, 1, 1, 300),
( 14, '万家乐热水器 银色 80L 2026 2000W ', '11123', 'http://129.204.203.29/wanjiale.jpg', '', 8999.00, 8899.00, 800, 80, '{"颜色": "银色", "容量": "80L", "款式": "2026", "功率": "2000W"}', 0.19, 1, 1, 2, 200),
# 海尔热水器
( 15, '海尔热水器 黑色 80L 2024 1500W', '12553', 'http://129.204.203.29/haier.jpg', '', 7999.00, 7899.00, 1000, 100, '{"颜色": "黑色", "容量": "80L", "款式": "2024", "功率": "1500W"}', 0.19, 1, 1, 1, 300),
( 15, '海尔热水器 银色 100L 2025 2000W ', '16623', 'http://129.204.203.29/haier.jpg', '', 8999.00, 8899.00, 800, 80, '{"颜色": "银色", "容量": "100L", "款式": "2025", "功率": "2000W"}', 0.19, 1, 1, 2, 200),
# 美的热水器
( 16, '美的热水器 黑色 60L 2024 1500W', '12387', 'http://129.204.203.29/meidi.png', '', 7999.00, 7899.00, 1000, 100, '{"颜色": "黑色", "容量": "60L", "款式": "2024", "功率": "1500W"}', 0.19, 1, 1, 1, 300),
( 16, '美的热水器 银色 100L 2026 3000W ', '18231', 'http://129.204.203.29/meidi.png', '', 8999.00, 8899.00, 800, 80, '{"颜色": "银色", "容量": "100L", "款式": "2026", "功率": "3000W"}', 0.19, 1, 1, 2, 200);
